/* Перший варіант */

const a = +prompt('Введите  довжини першого катету трикутника?');
const b = +prompt('Введите  довжини другого катету трикутника?');

if (a && b){
    let result = ((a**2)+(b**2))**(1/2);
    alert(`Довжину гіпотенузи = ${result}`);
}else {
    alert('Ви ввели невалідну довжину.')
}




/*  Двугий варіант */


// const a = +prompt('Введите  довжини першого катету трикутника?');
// const b = +prompt('Введите  довжини другого катету трикутника?');
//
//
// if (a && b){
//    let result = Math.sqrt(a**2 + b**2);
//     alert(`Довжину гіпотенузи = ${result}`);
// }else {
//     alert('Ви ввели невалідну довжину.')
// }