/* Перший варіант */

const a = +prompt('Введите  довжини першого катету трикутника?');
const b = +prompt('Введите  довжини другого катету трикутника?');

if (a && b){
    if(a >= 0 && b >= 0){
        let result = ((a**2)+(b**2))**(1/2);
        alert(`Довжину гіпотенузи = ${result}`);
    } else {
        alert('Ви ввели невалідну довжину.')
    }
}else {
    alert('Ви ввели невалідну довжину.')
}



// if(a <= 0){
//     console.log(a)
// }else {
//     console.log('else')
// }


/*  Двугий варіант */


// const a = +prompt('Введите  довжини першого катету трикутника?');
// const b = +prompt('Введите  довжини другого катету трикутника?');
//
//
// if (a && b){
//    let result = Math.sqrt(a**2 + b**2);
//     alert(`Довжину гіпотенузи = ${result}`);
// }else {
//     alert('Ви ввели невалідну довжину.')
// }